package homeworks.foursection;

public class Exercises {

/**
 DONE - 1)Приклад:
 агрогрегація написати код, залежність,   поріваняння Компанія - працівник пояснити

 DONE - 2)  Date vs  LocalDate два пакети зв одному Date в одному Local

 DONE - 3) як упакуватипару класів в один файл і які обмеження і яка назва

 DONE - 4) Модифікатори і зробити дерево класів з пакетами

 DONE - 5) використотати константи, статичні і нестатичні

 DONE - 6) статичний метод

 DONE - 7) написати 2 методи який приймає параметром стрінг і модифікує його, і в першій функції
 повертає змінене значення а в другій void і надрукувати оту стрінгу яку ти передавав в методи після
 виконання иметодів

 DONE - 8) Overload приклади функцій додати

 DONE - 9) Зробити так щоб один конструктор викликався в іншому

 DONE - 10) init block імплемент-розказати , статік і не статік

 11) статичний імпорт, варіанти

 DONE - 12) написати 2 методи який приймає параметром стрінг і модифікує його, і в першій функції
 повертає змінене значення, а в другій void і надрукувати оту стрінгу, яку ти передавав в методи після
 виконання иметодів --- але з ОБЄКТОМ

 13) все про передавання за значенням і за ссилкою, іммютабл, мютибл обєкти (чого зі Стрінгом це не спрацювало хоч це обєкт)

 DONE -  14) aggregation ---  дописати додавання емплої

 15) НЕ ЗАЛИШАТИ КОМЕНЧЕНИЙ КОД

 16) ФОРМАТУВАТИ КОД

 17)!!!!!!!!!!!!!!!! скласти чекліст по 4 розділу!!!!!!!!!!!!!!!!!

 18. Clone

 19. Зробити пул реквест
 */
}